import Image from "next/image"

function About() {
    return (
        <div className="container flex flex-row-reverse justify-between pb-[50px]">
            <div className="relative w-[40%] aspect-[2/2.5]"><Image src={"/assets/aboutUsImage.png"} alt="about" fill /></div>
            <div className="w-[50%]">
                <h4 className='text-white-color text-[20px] font-bold text-right leading-11.5 '>درباره <span className="text-orange">اَوستا</span> هوش‌یار</h4>
                <p className="text-white-color text-[14px] my-[15px] text-justify">
                    شرکت اوستا هوش‌یار، به‌عنوان نخستین شرکت خلاق در حوزه لجستیک و حمل‌ونقل ثبت‌شده در معاونت علمی و فناوری ریاست جمهوری، با رویکردی نوآورانه و حرفه‌ای در راستای بهینه‌سازی صنعت حمل‌ونقل کشور فعالیت می‌کند. این شرکت با بهره‌گیری از فناوری‌های پیشرفته و دانش بومی، خدمات گسترده‌ای در زمینه هوشمندسازی حمل‌ونقل، لجستیک، انبارداری و امور گمرکی ارائه می‌دهد. از تخلیه و بارگیری کشتی‌ها تا فرآیندهای ترخیص و ترانزیت کالا، تمامی مراحل با استفاده از سیستم‌های هوشمند مدیریت شده و موجب افزایش بهره‌وری و شفافیت در زنجیره تأمین می‌شود.
                    اوستا هوشیار با ارائه راهکارهای نرم‌افزاری پیشرفته، مدیریت بندری، ترخیص و حمل‌ونقل داخلی و بین‌المللی، نقش مهمی در تسهیل فرآیندهای لجستیکی ایفا می‌کند. این شرکت علاوه بر ارائه خدمات حمل‌ونقل و لجستیک، در حوزه عارضه‌یابی، تولید، مشاوره، پیاده‌سازی و پشتیبانی نیز فعالیت دارد. با نظارت لحظه‌به‌لحظه بر محموله‌ها، کاهش هزینه‌های حمل‌ونقل و افزایش سرعت انتقال کالا، راهکاری جامع و کارآمد برای مشتریان خود فراهم می‌سازد. همچنین، با تمرکز بر ارائه راه‌حل‌های سفارشی، نیازهای مختلف زنجیره تأمین را به‌صورت هوشمندانه و کارآمد برطرف می‌کند.
                </p>

                <div className="relative w-full h-[31px]" ><Image src={"/assets/linerImage.png"} alt="linerImage" fill /></div>

            </div>
        </div>
    )
}

export default About