
import { TManagers } from "@/types/types";
import { NextResponse } from "next/server";

export function GET() {
    const mn:TManagers[] = [
        {
            id: 1,
            name: 'علیرضا فرهمند',
            title: 'مدیر بازرگانی پشتیبانی امور دام',
            gender: 'man',
            img: '/assets/managers/userProfileImage.png',
            info: '"اعتماد به اوستا هوش‌یار برای ما یک تصمیم درست بود. دقت، سرعت و تعهد این مجموعه در حمل‌ونقل بارهای فله‌ای فراتر از انتظارات ما بود. همکاری با این شرکت تجربه‌ای عالی و اطمینان‌بخش است."'
        },
        {
            id: 2,
            name: 'علیرضا فرهمند',
            title: 'مدیر بازرگانی پشتیبانی امور دام',
            gender: 'man',
            img: '/assets/managers/userProfileImage-2.png',
            info: '"اعتماد به اوستا هوش‌یار برای ما یک تصمیم درست بود. دقت، سرعت و تعهد این مجموعه در حمل‌ونقل بارهای فله‌ای فراتر از انتظارات ما بود. همکاری با این شرکت تجربه‌ای عالی و اطمینان‌بخش است."'
        },
        {
            id: 3,
            name: 'دکتر کورش کیان',
            title: 'مدیر عامل شرکت ایرالکو',
            gender: 'man',
            img: '/assets/managers/userProfileImage-3.png',
            info: '"ما سال‌هاست که با اوستا هوش‌یار  همکاری می‌کنیم و همیشه از کیفیت خدمات، پاسخگویی سریع و مدیریت حرفه‌ای آن‌ها رضایت داشته‌ایم. این شرکت توانسته است با ارائه خدمات مطمئن و دقیق، اعتماد ما را جلب کند."'
        },
        {
            id: 4,
            name: 'علیرضا فرهمند',
            title: 'مدیر بازرگانی پشتیبانی امور دام',
            gender: 'man',
            img: '/assets/managers/userProfileImage.png',
            info: '"اعتماد به اوستا هوش‌یار برای ما یک تصمیم درست بود. دقت، سرعت و تعهد این مجموعه در حمل‌ونقل بارهای فله‌ای فراتر از انتظارات ما بود. همکاری با این شرکت تجربه‌ای عالی و اطمینان‌بخش است."'
        },
        {
            id: 5,
            name: 'علیرضا فرهمند',
            title: 'مدیر بازرگانی پشتیبانی امور دام',
            gender: 'man',
            img: '/assets/managers/userProfileImage-2.png',
            info: '"اعتماد به اوستا هوش‌یار برای ما یک تصمیم درست بود. دقت، سرعت و تعهد این مجموعه در حمل‌ونقل بارهای فله‌ای فراتر از انتظارات ما بود. همکاری با این شرکت تجربه‌ای عالی و اطمینان‌بخش است."'
        },
        {
            id: 6,
            name: 'دکتر کورش کیان',
            title: 'مدیر عامل شرکت ایرالکو',
            gender: 'man',
            img: '/assets/managers/userProfileImage-3.png',
            info: '"ما سال‌هاست که با اوستا هوش‌یار  همکاری می‌کنیم و همیشه از کیفیت خدمات، پاسخگویی سریع و مدیریت حرفه‌ای آن‌ها رضایت داشته‌ایم. این شرکت توانسته است با ارائه خدمات مطمئن و دقیق، اعتماد ما را جلب کند."'
        },
        {
            id: 7,
            name: 'علیرضا فرهمند',
            title: 'مدیر بازرگانی پشتیبانی امور دام',
            gender: 'man',
            img: '/assets/managers/userProfileImage.png',
            info: '"اعتماد به اوستا هوش‌یار برای ما یک تصمیم درست بود. دقت، سرعت و تعهد این مجموعه در حمل‌ونقل بارهای فله‌ای فراتر از انتظارات ما بود. همکاری با این شرکت تجربه‌ای عالی و اطمینان‌بخش است."'
        },
        {
            id: 8,
            name: 'علیرضا فرهمند',
            title: 'مدیر بازرگانی پشتیبانی امور دام',
            gender: 'man',
            img: '/assets/managers/userProfileImage-2.png',
            info: '"اعتماد به اوستا هوش‌یار برای ما یک تصمیم درست بود. دقت، سرعت و تعهد این مجموعه در حمل‌ونقل بارهای فله‌ای فراتر از انتظارات ما بود. همکاری با این شرکت تجربه‌ای عالی و اطمینان‌بخش است."'
        },
        {
            id: 9,
            name: 'دکتر کورش کیان',
            title: 'مدیر عامل شرکت ایرالکو',
            gender: 'man',
            img: '/assets/managers/userProfileImage-3.png',
            info: '"ما سال‌هاست که با اوستا هوش‌یار  همکاری می‌کنیم و همیشه از کیفیت خدمات، پاسخگویی سریع و مدیریت حرفه‌ای آن‌ها رضایت داشته‌ایم. این شرکت توانسته است با ارائه خدمات مطمئن و دقیق، اعتماد ما را جلب کند."'
        },

    ]
    return NextResponse.json(mn)
}