import { TDocs } from "@/types/types"

const dc:TDocs[] = [

    {
        id: 1,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame1.png",
        text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
    },
    {
        id: 2,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame2.png",
        text: "کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد"
    },
    {
        id: 3,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame3.png",
        text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
    },
    {
        id: 4,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame4.png",
        text: "کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد"
    },
    {
        id: 5,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame5.png",
        text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
    },
    {
        id: 6,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame6.png",
        text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
    },
    {
        id: 7,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame7.png",
        text: "کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد"
    },
    {
        id: 8,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame9.png",
        text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
    },
    {
        id: 9,
        title:'بخشی از گواهینامه‌ها و افتخارات اوستاهوش‌یار',
        img: "/assets/documents/Frame9.png",
        text: "کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد"
    },
]
export const docs = async ():Promise<TDocs[]> => {
    return await new Promise ((resolve , reject) =>{
        setTimeout(() => {
             resolve( dc);
        }, 1000);
    })
     
}